/*
 * @Date: 2024-12-09 12:48:16
 * @Description: 枚举常量
 */

export enum DayEnum {
  "日" = 0,
  "一" = 1,
  "二" = 2,
  "三" = 3,
  "四" = 4,
  "五" = 5,
  "六" = 6,
  "七" = 7,
  "八" = 8,
  "九" = 9,
  "十" = 10,
  "十一" = 11,
  "十二" = 12,
  "十三" = 13,
  "十四" = 14,
  "十五" = 15,
  "十六" = 16,
  "十七" = 17,
  "十八" = 18,
  "十九" = 19,
  "二十" = 20,
  "二十一" = 21,
  "二十二" = 22,
  "二十三" = 23,
  "二十四" = 24,
  "二十五" = 25,
  "二十六" = 26,
  "二十七" = 27,
  "二十八" = 28,
  "二十九" = 29,
  "三十" = 30,
  "三十一" = 31,
}

export enum WeekEnum {
  "星期日" = 0,
  "星期一" = 1,
  "星期二" = 2,
  "星期三" = 3,
  "星期四" = 4,
  "星期五" = 5,
  "星期六" = 6,
}

export enum MonthEnum {
  "一月" = 1,
  "二月" = 2,
  "三月" = 3,
  "四月" = 4,
  "五月" = 5,
  "六月" = 6,
  "七月" = 7,
  "八月" = 8,
  "九月" = 9,
  "十月" = 10,
  "十一月" = 11,
  "十二月" = 12,
}

export enum QuartEnum {
  "第一季度" = 1,
  "第二季度" = 2,
  "第三季度" = 3,
  "第四季度" = 4,
}